package com.javarush.test.level03.lesson12.home01;

/* Жить хорошо, а хорошо жить еще лучше
Вывести на экран надпись «Жить хорошо, а хорошо жить еще лучше»
*/

public class Solution
{
    public static void main(String[] args)
    {
        String s = "Жить хорошо, а хорошо жить еще лучше";
        System.out.println(s);//напишите тут ваш код
    }


}
